--- a/Documents/Product Requirements Document (PRD).md
+++ b/Documents/Product Requirements Document (PRD).md
@@ -449,33 +449,23 @@ The following diagrams and descriptions outline the primary user flows within th
-
-For a Guide refer to [PlantUML Activity Diagram](https://plantuml.com/activity-diagram-beta)
-
-```plantuml
-@startuml
-title Key Map
-
-: Represents the start or end of flow;
-: Represents a task or procedure; <<task>>
-: Represents an input operation; <<input>>
-: Represents an output operation; <<output>>
-
-if (Represents a decision point) then (Yes)
-  :Process Action 1; <<task>>
-else (No)
-  :Process Action 2; <<task>>
-endif
-@enduml
+```mermaid
+---
+title: Key Map
+---
+flowchart TD
+    Start(["Stadium: Represents the start or end of flow"]) --> Rectangle
+    Rectangle["Rectangle: Represents a task or procedure"] --> Subroutine
+    Subroutine[[Subroutine: Represents a subflow]] --> Decision
+    Decision{"Rhombus: Represents a decision point"}
+    Decision -- Yes --> Input[/Left Parallelogram: Represents an input/]
+    Decision -- No --> Output[\Right Parallelogram: Represents an output\]
+    Input --> End
+    Output --> End
+    End(["End of flow"])
 ```
 
-![User Flow's Key Map](Medias/UserFlows-KeyMap.png)
+For a guide, refer to the [Flowcharts Syntax](https://mermaid.js.org/syntax/flowchart)
